export const dataProject = [
  {
    "name": "منصة التجارة الإلكترونية (شبيهة بنون وأمازون)",
    "technologies": [
      "React.js",
      "Node.js",
      "Express.js",
      "MongoDB",
      "Socket.io"
    ],
    "features": [
      "نظام تسجيل التجار",
      "إدارة وتتبع الطلبات",
      "وظيفة الدردشة في الوقت الحقيقي",
      "تكامل بوابة الدفع"
    ]
  },
  {
    "name": "منصة قانونية للمحامين",
    "technologies": [
      "Flutter",
      "Firebase",
      "لوحة تحكم Angular"
    ],
    "features": [
      "بحث في القضايا النشطة",
      "إدارة ملفات العملاء والتفاعلات",
      "إجراء مكالمات صوتية وفيديو",
      "الدردشة في الوقت الحقيقي وإرفاق الملفات"
    ]
  },
  {
    "name": "سوق الهواتف المستعملة وخدمات الإصلاح",
    "technologies": [
      "React Native",
      "Firebase",
      "Node.js"
    ],
    "features": [
      "نظام إدراج الهواتف",
      "خدمة التوصيل للمنازل",
      "ضمان العودة خلال 24 ساعة",
      "طلب خدمات الإصلاح المنزلية"
    ]
  },
  {
    "name": "منصة السياحة التطوعية (شبيهة بـ Workaway)",
    "technologies": [
      "Angular",
      "Node.js",
      "Express.js",
      "MongoDB"
    ],
    "features": [
      "البحث عن فرص تطوعية",
      "إنشاء حسابات للمتطوعين والمضيفين",
      "نظام تقييم للمستخدمين",
      "الدردشة بين المضيفين والمتطوعين"
    ]
  },
  {
    "name": "منصة تعليمية عبر الإنترنت",
    "technologies": [
      "Angular",
      "Firebase",
      "WebRTC"
    ],
    "features": [
      "نظام إدارة الدروس",
      "تسجيل الطلاب والتقييمات",
      "دعم الفيديو والصوت للدروس الحية",
      "التفاعل المباشر بين الطلاب والمدرسين"
    ]
  },
  {
    "name": "إدارة حسابات TikTok",
    "technologies": [
      "Node.js",
      "Express.js",
      "Serverless",
      "MongoDB"
    ],
    "features": [
      "إدارة حسابات TikTok متعددة في نفس الوقت",
      "تخزين بيانات تسجيل الدخول بأمان لإعادة الاتصال التلقائي",
      "تنفيذ تفاعلات آلية (إعجابات، تعليقات، متابعة) على المنشورات",
      "جدولة المهام لتنفيذ التفاعلات في أوقات محددة لمحاكاة النشاط البشري",
      "تحليل أداء الحسابات عن طريق جمع البيانات حول التفاعلات والمشاركات",
      "لوحة تحكم سهلة الاستخدام لإدارة الحسابات وجدولة الأنشطة"
    ]
  }
]
